OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/src/stm8l15x_rtc.c
  /* Configure the Tampers Precharge Duration  and pull-up New settings*/
  RTC->TCR2 |= (uint8_t)RTC_TamperPrechargeDuration;

  /* Enable the write protection for RTC registers */
  RTC->WPR = 0xFF; 
}


/**
* @brief  Enables or Disables the Tamper detection.
* @param  RTC_Tamper: Select the tamper to configure.
*         This parameter can be one parameter from the @ref RTC_Tamper_TypeDef
*         enumeration.
* @param  NewState: new state of the tamper pin.
  *         This parameter can be: ENABLE or DISABLE.
* @retval None
*/
void RTC_TamperCmd(RTC_Tamper_TypeDef RTC_Tamper,
                   FunctionalState NewState)
{

  /* Check the parameters */
  assert_param(IS_RTC_TAMPER((uint8_t)RTC_Tamper));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for RTC registers */
  RTC->WPR = 0xCA;
  RTC->WPR = 0x53;


  if (NewState != DISABLE)
  {
    /* Enable the selected Tampers */
    RTC->TCR1 |= (uint8_t)RTC_Tamper;
  }
  else
  {
    /* Disable the selected Tampers */
    RTC->TCR1 &= (uint8_t)~RTC_Tamper;
  }


  /* Enable the write protection for RTC registers */
  RTC->WPR = 0xFF; 
}



/**
  * @}
  */

/** @defgroup RTC_Group11 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions  
 *
@verbatim   
 ===============================================================================
                       Interrupts and flags management functions
 ===============================================================================  
 
 To enable the RTC Alarm interrupt, the following sequence is required:
   - Configure the RTC to generate RTC alarm (Alarm A) using the RTC_SetAlarm() 
     and RTC_AlarmCmd() functions.

 To enable the RTC Wakeup interrupt, the following sequence is required:
   - Configure the RTC to generate the RTC wakeup timer event using the 
     RTC_WakeUpClockConfig(), RTC_SetWakeUpCounter() and RTC_WakeUpCmd() functions.

 To enable the RTC Tamper interrupt, the following sequence is required:
   - Configure the RTC to detect the RTC tamper event using the 
     RTC_TamperTriggerConfig() and RTC_TamperCmd() functions.



@endverbatim
  * @{
  */
/**
* @brief  Enables or Disables the specified RTC interrupts.
* @param  RTC_IT: specifies the RTC interrupt sources to be enabled or disabled.
*         This parameter can be any combination of the following values:
*         @arg RTC_IT_ALRA:  Alarm A interrupt
*         @arg RTC_IT_TAMP:  Tampers interrupt
*         @arg RTC_IT_WUT:  WakeUp Timer interrupt
* @param  NewState: new state of the specified RTC interrupts.
  *         This parameter can be: ENABLE or DISABLE.
* @retval None
*/
void RTC_ITConfig(RTC_IT_TypeDef RTC_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_RTC_CONFIG_IT(RTC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for RTC registers */
  RTC->WPR = 0xCA;
  RTC->WPR = 0x53;

  if (NewState != DISABLE)
  {
    /* Enable the Interrupts */
    RTC->CR2 |= (uint8_t)((uint16_t)RTC_IT & (uint16_t)0x00F0);
    RTC->TCR1 |= (uint8_t)((uint16_t)RTC_IT & RTC_TCR1_TAMPIE);
  }
  else
  {
    /* Disable the Interrupts */
    RTC->CR2  &= (uint8_t)~(uint8_t)((uint16_t)RTC_IT & (uint16_t)0x00F0);
    RTC->TCR1 &= (uint8_t)~(uint8_t)((uint16_t)RTC_IT & (uint16_t)RTC_TCR1_TAMPIE);
  }

  /* Enable the write protection for RTC registers */
  RTC->WPR = 0xFF; 
}
/**
* @brief  Checks whether the specified RTC flag is set or not.
* @param  RTC_FLAG: specifies the flag to check.
*         This parameter can be one of the @ref RTC_Flag_TypeDef enumeration.
* @retval Status of RTC_FLAG (SET or RESET)
*/
FlagStatus RTC_GetFlagStatus(RTC_Flag_TypeDef RTC_FLAG)
{
  FlagStatus flagstatus = RESET;
  uint16_t tmpreg1 = 0;
  uint16_t tmpreg2 = 0;

  /* Check the parameters */
  assert_param(IS_RTC_GET_FLAG(RTC_FLAG));

  /* Get all the flags */
  tmpreg2 = (uint16_t)((uint16_t)RTC->ISR1 << 8);
  tmpreg1 = (uint16_t)((uint16_t)((uint16_t)(RTC->ISR2)) | tmpreg2);

  /* Return the status of the flag */
  if ((tmpreg1 & (uint16_t)RTC_FLAG) != RESET)
  {
    flagstatus = SET;
  }
  else
  {
    flagstatus = RESET;
  }
  return (FlagStatus)flagstatus;
}

/**
* @brief  Clears the RTC's pending flags.
* @param  RTC_FLAG: specifies the RTC flag to clear.
*         This parameter can be any combination of the @ref RTC_Flag_TypeDef
*         enumeration.
* @retval None
*/
void RTC_ClearFlag(RTC_Flag_TypeDef RTC_FLAG)
{
  /* Check the parameters */
  assert_param(IS_RTC_CLEAR_FLAG((uint16_t)RTC_FLAG));

  /* Clear the Flags in the RTC_ISR registers */
  RTC->ISR2 = (uint8_t)~((uint8_t)RTC_FLAG) ;
  RTC->ISR1 = (uint8_t)(((uint8_t)~(uint8_t)((uint16_t)RTC_FLAG >> (uint8_t)8)) & ((uint8_t)~(uint8_t)(RTC_ISR1_INIT)));
}

/**
* @brief  Checks whether the specified RTC interrupt has occurred or not.
* @param  RTC_IT: specifies the RTC interrupt source to check.
*         This parameter can be one of the @ref RTC_IT_TypeDef enumeration.
* @retval Status of RTC_IT (SET or RESET).
*/
ITStatus RTC_GetITStatus(RTC_IT_TypeDef RTC_IT)
{
  ITStatus itstatus = RESET;
  uint8_t enablestatus = 0, tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_RTC_GET_IT(RTC_IT));

  /* Get the Interrupt enable Status */
  enablestatus = (uint8_t)(RTC->CR2 & (uint16_t)RTC_IT);

  /* Get the Interrupt pending bit */
  tmpreg = (uint8_t)(RTC->ISR2 & (uint8_t)((uint16_t)RTC_IT >> 4));

  /* Get the status of the Interrupt */
  if ((enablestatus != (uint8_t)RESET) && (tmpreg != (uint8_t)RESET))
  {
    itstatus = SET;
  }
  else
  {
    itstatus = RESET;
  }

  return (ITStatus)itstatus;
}

/**
* @brief  Clears the RTC's interrupt pending bits.
* @param  RTC_IT: specifies the RTC interrupt pending bit to clear.
*         This parameter can be any combination of the @ref RTC_IT_TypeDef
*         enumeration.
* @retval None
*/
void RTC_ClearITPendingBit(RTC_IT_TypeDef RTC_IT)
{
  /* Check the parameters */
  assert_param(IS_RTC_CLEAR_IT((uint16_t)RTC_IT));

  /* Clear the interrupt pending bits in the RTC_ISR registers */
  RTC->ISR2 = (uint8_t)~(uint8_t)((uint16_t)RTC_IT >> 4);
}

/**
  * @}
  */









/**
 * @addtogroup RTC_Private_Functions
 * @{
 */
/**
* @brief  Converts a 2 digit decimal to BCD format
* @param  Value: Byte to be converted.
* @retval Converted byte
*/
static uint8_t ByteToBcd2(uint8_t Value)
{
  uint8_t bcdhigh = 0;

  while (Value >= 10)
  {
    bcdhigh++;
    Value -= 10;
  }

  return  (uint8_t)((uint8_t)(bcdhigh << 4) | Value);
}

/**
* @brief  Converts from 2 digit BCD to Binary format
* @param  Value: BCD value to be converted.
* @retval Converted word
*/
static uint8_t Bcd2ToByte(uint8_t Value)
{
  uint8_t tmp = 0;

  tmp = (uint8_t)((uint8_t)((uint8_t)(Value & (uint8_t)0xF0) >> 4) * (uint8_t)10);

  return (uint8_t)(tmp + (Value & (uint8_t)0x0F));
}

/**
  * @}
  */ 

/**
  * @}
  */ 
  
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/